Repository: ducakar/openzone
Catalog: data/oz_main/lingua/*/oz_main.po
Languages: sl

source: gatling gun
sl: Gatlingova strojnica

source: tutorial - movement
sl: vpeljava - premikanje

source: explosion
sl: eksplozija

source: hover tank
sl: lebdeči tank

source: blaster
sl: udarnik

source: atlantis
sl: atlantida

source: tree
sl: drevo

source: bomb
sl: bomba

source: manual door
sl: navadna vrata

source: tutorial - carying
sl: vpeljava - prenašanje

source: grenade launcher
sl: granatomet

source: key
sl: ključ

source: first aid
sl: prva pomoč

source: chaingun
sl: strojnica

source: binoculars
sl: daljnogled

source: heavy blaster
sl: težki udarnik

source: Galileo SatNav
sl: navigacija Galileo

source: beast bunker
sl: beštji bunker

source: goblin
sl: škrat

source: crusher
sl: speštalnik

source: night vision goggles
sl: očala za nočno gledanje

source: console
sl: konzola

source: zombie
sl: zombi

source: pine
sl: smreka

source: shell
sl: granata

source: cyborg
sl: kiborg

source: > textures < Egyptian & Tech1 texture packs Sock > sounds < AwesundFX1 Awesund droid-sounds Kevin Good > BSP structures < Davorin Učakar > models < barrel, cbbox, tree2, tree3 Dietmar Pier barrel2, crate4 Psionic bauul, ratamahatta Brian "EvilBastard" Collins debris01, debris02, debris03, debris03 Markus "makkE" Bekel droid III_Demon goblin Conrad, Rodrigo hobgoblin Hunter, Burnt Kona, Fafner, Deranged pknight James Green, Ryan "MrRogers" Butts, NPherno > scripts < Davorin Učakar
sl: > teksture < Egyptian & Tech1 texture packs Sock > zvoki < AwesundFX1 Awesund droid-sounds Kevin Good > strukture BSP < Davorin Učakar > modeli < barrel, cbbox, tree2, tree3 Dietmar Pier barrel2, crate4 Psionic bauul, ratamahatta Brian "EvilBastard" Collins debris01, debris02, debris03, debris03 Markus "makkE" Bekel droid III_Demon goblin Conrad, Rodrigo hobgoblin Hunter, Burnt Kona, Fafner, Deranged pknight James Green, Ryan "MrRogers" Butts, NPherno > skripti < Davorin Učakar

source: skull
sl: lobanja

source: barrel
sl: sod

source: plasma gun
sl: plazemska puška

source: test castle
sl: testni grad

source: house
sl: hiša

source: crate
sl: zaboj

source: cannon
sl: top

source: hyperblaster
sl: nadudarnik

source: mace
sl: buzdovan

source: palm
sl: palma

source: service station
sl: servisna postaja

source: data cube
sl: podatkovna kocka

source: explosive barrel
sl: ekspozivni sod

source: box
sl: škatla

source: switch
sl: stikalo

source: pool
sl: bazen

source: auto door
sl: samodejna vrata

source: beast
sl: beštija

source: knight
sl: vitez

source: elevator
sl: dvigalo

source: axe
sl: sekira

source: grenade
sl: granata

source: tower
sl: stolp

source: music player
sl: predvajalnik glasbe
