Repository: ducakar/openzone
Catalog: data/openzone_missions/mission/cvicek/lingua/*.po
Languages: sl

source: Beast Lair
sl: Beštji brlog

source: Beast Lair is your home base, hidden on an island, still safe from Colonial Army. However, supplies are low and there's a terrible shortage of beasts' favourite drink, cvicek. You can visit the base anytime during the mission for any supplies you need.
sl: Beštji brlog je tvoja domača baza, skrita na otoku, kamor noga kolonialne vojske še ni stopila. V bazi primanjkuje zalog, predvsem kritično je pomanjkanje cvička, najljubše pijače beštij. Bazo lahko obiščeš kadarkoli med misijo, da se okrepčaš ali vzameš kakšne stvari, ki jih potrebuješ.

source: Cvicek, cvicek, cvicek ... Where is cvicek?
sl: Cviček, cviček, cviček ... kje je cviček?

source: Escape
sl: Pobeg

source: Good job!
sl: Čestitam, dobro opravljeno!

source: Good riddance! Finally some decent TV programme.
sl: Kmetija je šla v luft, hehe! Končno imamo gledljiv TV spored.

source: How's your mission going? I can't imagine how we will live without cvicek.
sl: Kako napreduje misija? Ne vem, kako bomo preživeli brez cvička.

source: I'm sooo thirsty. I've been drinking only water for the past week.
sl: Kako sem žejen. Že cel teden pijem samo vodo.

source: Is the Farm still standing? Please destroy it, maybe then there might be something better on TV.
sl: A Kmetija še stoji? Daj jo uniči, bo mogoče potem kaj bolj pametnega po televiziji.

source: No more thirst!
sl: Moja žeja je končno pogašena.

source: Steal at least 20 bottles of cvicek from Colonial military base and transport them back to Beast Lair. The base is heavily defended so you will need some heavy armour to attack it. Beware not to use explosives there, cvicek bottles are very fragile and there is a explosives storage in that base. Quest will be complete one you unload 20 bottles of cvicek in the Lair.
sl: Ukradi vsaj 20 steklenic cvička iz kolonialne vojaške baze in jih prepelji v Beštji brlog. Baza je močno varovana, zato boš za napad potreboval tank. Pazi, da v bazi ne uporabljaš eksploziva zaradi tamkajšnjega skladišča eksploziva in krhkih steklenic cvička. Naloga se zaključi, ko v Brlogu raztovoriš 20 steklenic cvička.

source: Steal cvicek
sl: Kraja cvička

source: That farm is a stage of an annoying reality show called 'The Farm'. It wouldn't do much harm to blow it up. The farmhouses are not very robust, so a dozen of bombs should be more then enough to demolish them. And don't expect any welcome from participants of the show.
sl: Ta kmetija je prizorišče neumnega resničnostnega šova najbolj gledane komercialne televizije. Ne bo dosti škode, če jo razstreliš. Kmetijska poslopja niso preveč trdna, kakšen ducat dobro postavljenih bomb bi zagotovo moral zadostovati. Pazi se udeležencev šova; gotovo te ne bodo veseli.

source: The Farm
sl: Kmetija

source: Well, is cvicek coming anytime soon?
sl: Bo cviček kaj kmalu?

source: Yeeha! Cvicek!
sl: Juhuhu! Cviček!

source: You have been caught by a Colonial patrol and they currently hold you in that Colonial outpost. Tomorrow you are being transferred to a Colonial detention camp for terrorist suspects. If you don't find a way to escape, say goodbye to freedom till the end of your life. It would be extremely helpful if you can get a Galileo gadget, it will will show you destinations of your tasks and help you with navigation a lot.
sl: Zajela te je kolonialna patrulja in zdaj si zaprt v tej kolonialni postojanki. Jutri te bodo poslali v taborišče za osumljene terorizma in verjetno ne boš nikoli več ugledal luči svobode, zato ti ne preostane drugega, kot da poskušaš pobegniti. Če ti uspe najti navigacijo Galileo, ti bo to v izjemno pomoč, saj med drugim prikazuje tudi položaje posameznih nalog.
