Repository: ducakar/openzone
Catalog: data/oz_missions/mission/01_cvicek/lingua/*.po
Languages: sl

source: I'm sooo thirsty. I've been drinking only water for the past week.
sl: Kako sem žejen. Že cel teden pijem samo vodo.

source: Beast Lair is your home base, hidden on an island, still safe from Colonial Army. However, supplies are low and there's a terrible shortage of beasts' favourite drink, cviček. You can visit the base anytime during the mission for any supplies you need.
sl: Beštji brlog je tvoja domača baza, skrita na otoku, kamor noga kolonialne vojske še ni stopila. V bazi primanjkuje zalog, predvsem kritično je pomanjkanje cvička, najljubše pijače beštij. Bazo lahko obiščeš kadarkoli med misijo, da se okrepčaš ali vzameš kakšne stvari, ki jih potrebuješ.

source: No more thirst!
sl: Moja žeja je končno pogašena.

source: Escape
sl: Pobeg

source: ... those will be scrapped soon. That would be a shame, no true beast would allow so much precious liquid to be thrown away.
sl: ... te pa bodo kmalu odposlane na uničenje. To bi bila velika škoda, nobena prava beštija ne bi dopustila, da bi šlo v nič toliko žlahtnih kapljic.

source: The Farm
sl: Kmetija

source: He will need to do some clever tricks to escape and finish his mission ...
sl: Za pobeg in dokončanje naloge bo potreboval nekaj iznajdljivosti ...

source: Beast Lair. You home village. Its inhabitants suffer critical shortage of their favourite drink, cviček.
sl: Beštji Brlog. Tvoja domača vas. Trenutno njegovi prebivalci trpijo hudo pomanjkanje svoje najljubše pijače, cvička.

source: Good job!
sl: Čestitam, dobro opravljeno!

source: Is the Farm still standing? Please destroy it, maybe then there might be something better on TV.
sl: A Kmetija še stoji? Daj jo uniči, bo mogoče potem kaj bolj pametnega po televiziji.

source: You have been caught by a Colonial patrol and they currently hold you in that Colonial outpost. Tomorrow you are being transferred to a Colonial detention camp for terrorist suspects. If you don't find a way to escape, say goodbye to freedom till the end of your life. It would be extremely helpful if you can get a Galileo gadget, it will will show you destinations of your tasks and help you with navigation a lot.
sl: Zajela te je kolonialna patrulja in zdaj si zaprt v njihovi postojanki. Jutri te bodo poslali v taborišče za osumljene terorizma in verjetno ne boš nikoli več ugledal luči svobode, zato ti ne preostane drugega, kot da poskušaš pobegniti. Če ti uspe najti navigacijo Galileo, ti bo to v izjemno pomoč, saj prikazuje tvoj položaj in položaje posameznih nalog.

source: The beast hero decided to rob a military base in mountains, where large quantities of confiscated cviček are stored ...
sl: Junaška beštija se je namreč odločila oropati kar vojaško bazo visoko v gorah, kjer hranijo zasežene zaloge cvička ...

source: Good riddance! Finally some decent TV programme.
sl: Kmetija je šla v luft, hehe! Končno imamo gledljiv TV spored.

source: But there was a hero who went on a long and dangerous mission to bring cviček to his home village.
sl: A našel se je junak, ki je odšel na dolgo in nevarno misijo, da bi svoji vasi priskrbel zalogo cvička.

source: Beast Lair
sl: Beštji brlog

source: Steal at least 20 bottles of cviček from Colonial military base and transport them back to Beast Lair. The base is heavily defended so you will need some heavy armour to attack it. Beware not to use explosives there, cviček bottles are very fragile and there is a explosives storage in that base. Quest will be complete one you unload 20 bottles of cviček in the Lair (bottles inside an inventory, a box or a vehicle don't count).
sl: Ukradi vsaj 20 steklenic cvička iz kolonialne vojaške baze in jih prepelji v Beštji brlog. Baza je močno varovana, zato boš za napad potreboval tank. Pazi, da v bazi ne uporabljaš eksploziva zaradi tamkajšnjega skladišča eksploziva in krhkih steklenic cvička. Naloga se zaključi, ko v Brlogu raztovoriš 20 steklenic (če je steklenica v inventarju, zaboju ali vozilu ne šteje).

source: But not everything went according to plan. The hero has been captured by a Colonial patrol and is now imprisoned in an outpost, waiting for deportation to a secret prison for terrorism suspects.
sl: A ni šlo vse po načrtu. Junaka je zajela kolonialna patrulja in sedaj zaprt v postojanki čaka na deportacijo v skrivni zapor za teroristične osumljence.

source: Cviček, cviček, cviček ... Where is cviček?
sl: Cviček, cviček, cviček ... kje je cviček?

source: That farm is a stage of an annoying reality show called 'The Farm'. It wouldn't do much harm to blow it up. The farmhouses are not very robust, so a few bombs or a heavier weapon should do the trick. And don't expect any welcome from participants of the show.
sl: Ta kmetija je prizorišče nadležnega resničnostnega šova najbolj gledane komercialne televizije. Ne bo dosti škode, če jo razstreliš. Kmetijska poslopja niso preveč trdna. Nekaj dobro postavljenih bomb ali težje orožje bi moralo zadostovati. Pazi se tudi udeležencev šova, saj te gotovo ne bodo veseli.

source: How's your mission going? I can't imagine how we will live without cviček.
sl: Kako napreduje misija? Ne vem, kako bomo preživeli brez cvička.

source: You have to escape from a Colonial outpost after a failed mission of stealing wine and try it again.
sl: Med neuspelo misijo kraje cvička te je zajela kolonialna patrulja. Pobegniti moraš iz njihove postojanke in ponovno poskusiti ukrasti cviček.

source: Steal cviček
sl: Kraja cvička

source: Mission 1: Cviček
sl: Misija 1: Cviček

source: Well, is cviček coming any time soon?
sl: Bo cviček kaj kmalu?

source: Yeeha! Cviček!
sl: Juhuhu! Cviček!
