Repository: ducakar/openzone
Catalog: data/oz_missions/mission/00_tutorial/lingua/*.po
Languages: sl

source: 8. PUSHING IN WATER You will need a create from the previous room for this one. Bring it here, throw it in the water and push it under water to the other side. There you will need the crate to jump on it to climb on a ledge. You can also push an object upwards or downwards with side-pushing while the object is in the water.
sl: 8. POTISKANJE POD VODO Tukaj boš potreboval eno škatlo iz prejšnje sobe. Spravi jo sem, jo vrzi v vodo in pod vodo potiskaj v naslednji prostor. Tam jo boš potreboval, da boš skočil nanjo in nato splezal na polico. Podobno kot predmete potiskaš vstran, jih lahko v vodi potiskaš tudi navzgor ali navzdol.

source: Tutorial
sl: Vpeljava

source: 7. CARRYING You can also carry around objects that you are strong enough to lift. Press middle mouse button to lift/drop an object when you see the 'lift' or 'carrying' icon under your crosshair. To throw the object you are carrying roll your mouse wheel up. There are some limitations though. E.g. you cannot lift objects while climbing a ladder or holding a weapon. You also cannot lift somebody who is already carrying something and you cannot run while carrying an object. The object you carry will fall from your hands if you jump of if it touches some other object above (so you cannot carry several stacked objects). If somebody else carries you, you can free yourself with jumping. Now use the available boxes to get to the next room.
sl: 7. PRENAŠANJE Nekatere predmete lahko tudi dvigneš, odvisno od tega kako močan si. Kadar vidiš ikono 'dvig' ali 'nošenje' pod merkom, lahko pritisneš srednji miškin gumb za dvig/spust. Če zavrtiš kolešček gor, medtem ko nosiš predmet, ga vržeš. Je pa nekaj omejitev. Na primer, ni mogoče dvigovati predmetov plezaš po lestvi ali držiš orožje. Tudi nekoga, ki že prenaša kakšen predmet, ni mogoče dvigniti in kadar prenašaš predmet ne moreš teči. Če med prenašanjem predmeta skočiš ali se predmet zgoraj dotakne drugega predmeta, ti pade iz rok (torej ni mogoče prenašati več predmetov enega na drugem). Če te nosi kdo drug, se lahko osvobodiš, tako da skočiš. Uporabi zdaj škatle v tej sobi, da prideš v naslednjo.

source: 16. WEAPONS To use a weapon you first need to put in in your inventory. By right clicking it in you inventory interface you can arm (red fist icon) and disarm it (grey fist icon). There's also a shortcut: when you right click a weapon laying on the floor you will both put it in your inventory and arm it at the same time. You are only able to use weapons suitable for your bot class (e.g. if you are a beast you cannot use droid weapons and vice versa). To fire your current weapon press left mouse button. Test that plasma gun on objects ahead and those two droids.
sl: 16. OROŽJA Da uporabiš orožje, ga moraš najprej imeti v inventarju. Z desnim klikom na orožje v inventarju ga vzameš v roke (ikona je rdeča pest) ali pospraviš nazaj (siva pest). Obstaja tudi bližnjica: če z desno klikneš orožje, ki ga najdeš, ga hkrati vneseš v inventar in vzameš v roke. Uporabljaš lahko le orožja, ki pritičejo tvojemu tipu bota (npr. beštije ne morejo uporabljati droidskih orožij in obratno). Za streljanje s trenutnim orožjem pritisneš levi gumb. Preizkusi plazemsko puško na predmetih pred seboj in na dveh droidih.

source: 17. CORPSES Corpses can also be searched for items. Use them like the metal container before. But don't wait too long. Corpses disappear some time after death.
sl: 17. TRUPLA Trupla lahko preiščeš enako kot prejšnji kovinski zaboj. Vendar ne smeš čakati predolgo. Določen čas po smrti truplo izgine.

source: 3. LADDERS To move up or down a ladder just look in the desired direction while you are touching the ladder. If you move away from the ladder, you will fall from it. Be careful when you want to go down the ladder. Approach the ladder slowly or you may miss it and fall. Note that you cannot climb a ladder when you are carrying some object in your hands.
sl: 3. LESTVE Za premikanje navzgor ali navzdol po lestvi zgolj glej v želeno smer medtem, ko se dotikaš lestve. Če pomakneš stran od lestve, padeš z nje. Ko sestopaš na lestev, pazi, da greš počasi preko roba, saj lahko sicer zgrešiš lestev. Po lestvi ni mogoče plezati, kadar v rokah prenašaš kakšen predmet.

source: 15. BOMBS Some objects like this bombs are dangerous. They will explode when destroyed or 5 s after activation (they can also be deactivated by right clicking them again).
sl: 15. BOMBE nekateri predmeti, kot so bombe, so nevarni. Če se uniči ali pa 5 s po aktivaciji eksplodira (v tem času jo lahko deaktiviraš, tako da jo ponovno klikneš z desnim gumbom).

source: 19. TRUNK Some vehicles also have a trunk. In that case you can swap items between your inventory and the vehicle as you did for that metal crate. It also works once you are in the vehicle (just press TAB key to open inventory window).
sl: 19. PRTLJAŽNIK Nekatera vozila imajo prtljažnik. V tem primeru lahko prenašaš predmete med svojim inventarjem in vozilom na enak način, kot si to počel s kovinskim zabojem. To deluje tudi kadar si že v vozilu (pritisni TAB, da odpreš vmesnik inventarja). Ta raptor ima zelo velik prtljažnik. Z vrtenjem miškinega koleščka nad vmesnikom se lahko pomikaš gor/dol.

source: 11. TRANSFER BETWEEN INVENTORIES If you see two arrows left of you crosshair, you can browse object in front of you and swap items between it and your inventory. If you roll your mouse wheel down, both inventories will be shown. With left click you can transfer items between the inventories. Sometimes inventory is to big for all slots to be shown. In such case you can scroll slots in the inventory windows with your mouse wheel. Arrows on top left and/or bottom left side are shown when the inventory can be scrolled.
sl: 11. PRENOS MED INVENTARJI Če levo od merka vidiš dve puščici, lahko preiščeš predmet pred seboj in med svojim inventarjem in tem predmetom izmenjuješ stvari. Če zavrtiš miškin kolešček navzdol, bosta prikazana oba inventarja. med njima prenašaš z levim klikom. Včasih je inventar prevelik, da bi bili prikazani vsi prostorčki. V tem primeru se lahko pomikaš med vrsticami z vrtenjem miškinega koleščka nad oknom inventarja. Na levi strani sta prikazani puščici navzgor in/ali navzdol, ki kažeta v katero smer so še skrite vrstice v inventarju.

source: 12. HEALTH First aid kits are disposable, you can only use them once. If you are not seriously hurt it's probably best to spare first aid for a later time. There's also a bonus if you are a beast (which you currently are): your health regenerates slowly. One first aid kit restores 100 units of health. Beasts like you have 150 units of health. Your health is show in a green bar above stamina (becomes red when your health drops). If you are heavily wounded, you are unable to run.
sl: 12. ZDRAVJE Prve pomoči so za enkratno uporabo. Če nisi resno ranjen, je bolje, da z njo varčuješ za pozneje. Če si beštija (kar trenutno si) se tvoje zdravje počasi obnavlja samo od sebe. Ena prva pomoč ti da 100 enot zdravja. Beštija kot si ti jih ima 150. Tvoje zdravje je prikazano kot zelen trak nad kondicijo (postaja rdeče, ko ga je manj). Če si težje ranjen, ne moreš več teči.

source: 2. LEDGE CLIMBING You can climb on a ledge if you hold SPACEBAR and W simultaneously.
sl: 2. PLEZANJE NA POLICO Na polico pred sabo lahko splezaš s sočasnim tiščanjem tipk PRESLEDNICA in W.

source: 4. SWIMMING For swimming you use the same controls as for basic movement. To dive, just look down and move forwards. You must only watch that you are running (and not crouching), as you must swim fast enough to dive.
sl: 4. PLAVANJE Plavaš z istimi tipkami kot se premikaš. Za potop glej navzdol in se pomakni naprej. Plavati moraš tudi dovolj hitro, zato se ti verjetno ne bo uspelo potopiti, če nimaš vklopljenega teka (ali pa čepiš).

source: 22. OBJECTIVES When in the user interface mode, you see your current objective on top of the screen. By clicking '+' you can open or close objective description and by clicking '<' and '>' you cycle between all available objectives for the current mission. If you posses Galileo gadget, you also see your current objective position on your minimap.
sl: 22. NALOGE V uporabniškem vmesniku je tvoja trenutna naloga prikazana na vrhu zaslona. S klikom na '+' lahko prikažeš ali skriješ podrobnejši opis naloge, s klikoma na '<' in '>' pa krožiš med razpoložljivimi nalogami trenutne misije. Če poseduješ Galileo, je položaj trenutne naloge prikazan na mini zemljevidu.

source: 20. SERVICE STATION You can repair and rearm vehicles at a service station. Park a vehicle close enough, go out and use the service station. Service station will also reload all weapons in your inventory. For mechanical units, it will also heal (repair) them and refill their stamina.
sl: 20. SERVISNA POSTAJA Pri servisni postaji lahko vozila popraviš in ponovno oborožiš. Parkiraj vozilo dovolj blizu, pojdi ven in uporabi servisno postajo. Servisna postaja bo tudi naložila vsa orožja v tvojem inventarju z novim strelivom, mehanske enote pa bo tudi pozdravila (popravila) in obnovila njihovo kondicijo.

source: 6. PUSHING You can push around many object you see. It's also possible to push them to the side if you don't walk into them directly, but slightly to one side (diagonally).
sl: 6. POTISKANJE Veliko predmetov je mogoče potiskati. Potiskaš jih lahko tudi vstran, če ne potiskaš direktno v predmet, ampak nekoliko v stran (po diagonali).

source: 1. MOVEMENT Use W, A, S, D to move and mouse to look around. You can jump with SPACE, toggle crouch with LCTRL or C and toggle running with LSHIFT. If you crouch you are a bit lower, so you can go under some obstacles, but you cannot run.
sl: 1. PREMIKANJE S tipkami W, A, S, D se premikaš, z miško pa gledaš naokoli. Skačeš s PRESLEDNICO, počep preklopiš z LCTRL ali C ter tek preklopiš z LSHIFT. Če čepiš, si malo nižji in greš zato lahko pod nekaterimi ovirami, vendar pa ne moreš teči.

source: 10. INVENTORY If you see a blue hand icon right to your crosshair, it means you can activate the object with right click. Purple icon left to your crosshair means the item can be put into your inventory if you roll mouse wheel down. You can only put items into your inventory if you have enough room. By left clicking an item in you inventory interface you will drop it and with middle click you will start to carry it like boxes in previous tutorial. For both actions you need enough room in front of you. You can still activate items while they are in your inventory (blue hand is shown at the bottom of inventory window if the selected item can be activated).
sl: 10. INVENTAR Če vidiš ikono z modro roko poleg merka, lahko predmet uporabiš, če klikneš z desno tipko. Vijolična ikona levo od merka pomeni, da lahko predmet spraviš v svoj inventar, če zavrtiš miškin kolešček navzdol. Predmet lahko pobereš le, če imaš v inventarju prost prostorček. Z levim klikom predmeta v vmesniku inventarja, ta predmet odvržeš, s srednjim klikom pa začneš z nošenjem predmeta, podobno kot si prenašal zaboje v prejšnji predstavitvi. Za obe dejanji moraš imeti pred seboj dovolj prostora za predmet. Tudi preko vmesnika inventarja lahko predmete uporabiš (v tem primeru vidiš modro ikono za uporabo v kotu okna z inventarjem).

source: In this mission player should learn how to play OpenZone and get familiar with all aspects of the game.
sl: Ta misija je namenjena seznanjenju z osnovami igre OpenZone.

source: 18. VEHICLES You can use the same keys to control vehicle as for movement. To switch weapons use right mouse button. To exit the vehicle press X and to eject press ALT + X. On destruction some vehicles automatically eject you.
sl: 18. VOZILA Vozila krmiliš s istimi tipkami kot se premikaš. Orožja menjavaš z desnim miškinim klikom. Za izhod iz vozila pritisni X, za izskok pa ALT + X. Nekatera vozila te od uničenju samodejno izvržejo.

source: Get familiar with all aspects of OpenZone game.
sl: Seznani se z vsemi vidiki igre OpenZone.

source: 9. USER INTERFACE Use TAB key to toggle between freelook and UI mode. In UI mode you see several other windows (depending on situation) and manage your inventory. You can still look around in UI mode by pushing mouse cursor into edges of the screen. Windows can be dragged around with left mouse button while holding the ALT key.
sl: 9. UPORABNIŠKI VMESNIK S tipko TAB preklapljaš med načinom prostega pogleda in med načinom uporabniškega vmesnika. V uporabniškem vmesniku se nahaja več oken (odvisno od nastavitev), med drugim tudi okno za upravljanje inventarja. V načinu uporabniškega vmesnika lahko še vedno gledaš naokoli, tako da miškin kazalec potiskaš v robove zaslona. Okna lahko premikaš s tiščanjem tipke ALT in vleko z levim miškinim gumbom.

source: 21. STRATEGIC MODE (Read to the end before you try it.) You can exit the bot you are controlling by pressing I key. That puts you in strategic mode. You move the camera the same way you move your bot. By pressing NUMPAD ENTER you switch between strategic camera (top-down) and free camera. In both modes you can still use TAB key to toggle between user interface mode and freelook mode. To incarnate into a bot select it by left clicking and press I. Reincarnation and strategic mode are not always available. Depending on a mission, reincarnation can be limited to specific bots only or completely disabled (including strategic mode).
sl: 21. STRATEŠKI NAČIN (Preberi do konca preden poizkusiš.) S pritiskom na tipko I lahko zapustiš bota, ki ga trenutno nadziraš in vstopiš v strateški način. V tem načinu upravljaš s kamero na podoben način kot bota. Z NUMPAD ENTER preklapljaš med strateško kamero (pogled od zgoraj) in prosto kamero. V obeh načinih je prav tako mogoče s tipko TAB preklapljat med uporabniškim vmesnikom in med prostim pogledom. Za inkarnacijo v bota ga izberi z levim klikom in pritisni I. Reinkarnacija in strateški način nista vedno na voljo. Odvisno od posamezne misije je reinkarnacija lahko omejena na določene bote ali pa popolnoma onemogočena (vključno s strateškim načinom).

source: 5. STAMINA You probably noticed the blue bar in bottom left corner starts to drain if you are running, jumping, climbing, throwing objects or swimming under water. That is you stamina. If it runs out, you are not able to perform those actions any more. Be careful it doesn't run out while you are under water or you will start to drawn. Your stamina is restoring while you are still or walking.
sl: 5. KONDICIJA Verjetno si opazil, da se modri trak v levem spodnjem kotu zaslona zmanjšuje, kadar tečeš, skačeš, plezaš, mečeš predmete ali plavaš pod vodo. To je tvoja kondicija. Če ti je zmanjka, omenjenih dejanj ne moreš več izvajati. Pazi, če ti kondicije zmanjka pod vodo, saj se boš začel utapljati. Kondicija se obnavlja, kadar si pri miru ali hodiš.

source: 13. SPECIAL ITEMS There are also some items that give you special abilities when in your inventory. Galileo enables a minimap (press M while in UI mode to maximise it), music player enables a Music Player window while in UI mode, while night vision goggles and binoculars can be activated by pressing N and B keys respectively. Note that some types of bots and vehicles already have some of those features built-in.
sl: 13. POSEBNI PREDMETI Nekateri predmeti ti podelijo posebne zmožnosti, če jih poseduješ. Galileo ti da mini zemljevid (kadar si v načinu uporabniškega vmesnika, pritisni M za povečanje), predvajalnik glasbe omogoči istoimensko okno v načinu uporabniškega vmesnika, očala za nočno gledanje ter daljnogled pa lahko omogočiš s tipkama N in B. Nekateri tipi botov in vozil utegnejo imeti te funkcije že vgrajene.

source: 14. SAVING AND CAMERA There are some dangers ahead. You can quick-save with F5 and quick-load with F7. Every time you exit the level, it is auto-saved. To load last auto-saved state press F8. To toggle to 3rd person view use NUMPAD ENTER and to toggle free camera rotation press NUMPAD *.
sl: 14. SHRANJEVANJE IN KAMERA Pred tabo je nekaj nevarnosti. Na hitro lahko shraniš s tipko F5, hitro shranjeno igro pa naložiš z F7. Vsakokrat ko zapustiš stopnjo, se ta samodejno shrani. Z F8 naložiš nazadnje samodejno shranjeno stopnjo. Za preklop med tretjeosebnim pogledom uporabi NUMPAD ENTER in za preklop proste rotacije kamere NUMPAD *.
